frontend/controllers/EventoController.php

SELECT * FROM `evento`
---
    public function actionIndex()
    {
        $events = Evento::find()->All();