frontend/controllers/SiteController.php

    public function actionSignup()
    {
        $model = new SignupForm();
        // se establece una variable donde se obtendran los authitem
        $authItems = AuthItem::find()->all();
---
SELECT * FROM `auth_item`