frontend/views/revision/_form.php


    <?= $form->field($model, 'estado')->dropDownList([ 'Corrección' => 'Corrección', 'Rechazado' => 'Rechazado', 'Aceptado' => 'Aceptado', ], ['prompt' => '']) ?>

    <?= $form->field($model, 'idanteproyecto')->dropDownList(
      ArrayHelper::map(Anteproyecto::find()->all(), 'idanteproyecto', 'nombre'),
      ['prompt' => 'Seleccione el Anteproyecto']
      ) ?>
---
SELECT * FROM `anteproyecto`