frontend/views/director-proyecto-por-proyecto/_form.php

SELECT * FROM `director_proyecto` ORDER BY `nombre`
SELECT * FROM `proyecto` ORDER BY `nombre`
---
<div class="director-proyecto-por-proyecto-form">
    <div class="panel-body">
        <?php $form = ActiveForm::begin(); ?>
        <?= $form->field($model, 'iddirector_proyecto')->dropDownList(ArrayHelper::map(DirectorProyecto::find()->orderBy(['nombre' => SORT_ASC])->all(), 'iddirector_proyecto', 'nombre'), ['prompt' => 'seleccione el director']); ?>
        <?= $form->field($model, 'idproyecto')->dropDownList(ArrayHelper::map(Proyecto::find()->orderBy(['nombre' => SORT_ASC])->all(), 'idproyecto', 'nombre'), ['prompt' => 'seleccione el Proyecto']);?>