frontend/views/director-proyecto-por-proyecto/reportdir.php


    <div class="form-group">

      <?= $f->field($form, 'q')->dropDownList(
          ArrayHelper::map(DirectorProyecto::find()->all(), 'iddirector_proyecto', 'nombre'),
          ['prompt' => 'seleccione el director']
        ) ?>
---
SELECT * FROM `director_proyecto`