frontend/views/revisionp/_form1.php

            <?= $form->field($model, 'estado')->dropDownList([ 'Corrección' => 'Corrección', 'Rechazado' => 'Rechazado', 'Aceptado' => 'Aceptado',], ['prompt' => '']) ?>
        </div>
        <div class="col-md-6">
            <?=
            $form->field($model, 'idproyecto')->dropDownList(
                    ArrayHelper::map(Proyecto::find()->all(), 'idproyecto', 'nombre'), ['disabled' => true], ['prompt' => 'selesccione el Proyecto']
            )
---
SELECT * FROM `proyecto`