frontend/views/anteproyecto/_form.php

                <?= $form->field($model, 'descripcion')->textInput(['maxlength' => true]) ?>
            </div>
            <div class="col-md-3">
                <?=
                $form->field($model, 'idmodalidad')->dropDownList(
                        ArrayHelper::map(Modalidad::find()->all(), 'idmodalidad', 'nombre'), ['prompt' => 'seleccione una modalidad']
                )
---
SELECT * FROM `modalidad`