frontend/views/anteproyecto/reportante.php


    <div class="form-group">

      <?= $f->field($form, 'q')->dropDownList(
          ArrayHelper::map(Modalidad::find()->all(), 'idmodalidad', 'nombre'),
          ['prompt' => 'seleccione la Modalidad']
        ) ?>
---
SELECT * FROM `modalidad`