frontend/models/RevisionpSearch.php

SELECT * FROM `revisonp` WHERE `secretario_aprobado`='si'
---
    public function search($params)
    {
        $query = Revisonp::find()->where();
        if (Yii::$app->user->can('Estudiante'))
        {
            $query = Revisonp::find()->where(['secretario_aprobado' => 'si']);