frontend/models/SignupForm.php

    public function signup()
    {
        if ($this->validate()) {
          $user = new User();
          $user->nombre = $this->nombre;
          $user->apellido = $this->apellido;
          $user->codigo_estudiantil = $this->codigo_estudiantil;
          $user->facultad = $this->facultad;
          $user->username = $this->username;
          $user->email = $this->email;
          $user->setPassword($this->password);
          $user->generateAuthKey();
          $user->updated_at = date('Y-m-j');
          $user->save();


          // agregamos los permisos al usuario
          $permissionList = $_POST['SignupForm']['permissions'];
          foreach ($permissionList as $value)
          {
              $newPermission = new AuthAssignment;
              $newPermission->user_id = $user->id;
              $newPermission->item_name = $value;
              $newPermission->save();
---
INSERT INTO `user` (`nombre`, `apellido`, `codigo_estudiantil`, `facultad`, `username`, `email`, `password_hash`, `auth_key`, `updated_at`, `status`, `created_at`) VALUES ('camilo', 'ruiz', '128931', 'selecciones una facultad', 'nj', 'kjdsf@jf.com', '$2y$13$JnhxKSBdgI.LR44OzhdTFO5DUhHozh5bQHnvK5Jk4WGmSTEd.0vAC', 'VXQJhZu1MbQQm-8Q16stK2LpzRz06JAc', '2017-12-3', 'Activo', '2017,12,03')
INSERT INTO `auth_assignment` (`user_id`, `item_name`) VALUES (63, 'Comite')