frontend/views/novedades/_form.php

]);?>


    <?= $form->field($model, 'idproyecto')->dropDownList(
        ArrayHelper::map(Proyecto::find()->all(), 'idproyecto', 'nombre'),
        ['prompt' => 'seleccione el proyecto']
      ) ?>
---
SELECT * FROM `proyecto`